tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "stripe/stripe-cli"
tap "supabase/tap"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Collection of portable C++ source libraries
brew "boost"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Improved top (interactive process viewer)
brew "htop"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Simple terminal UI for git commands
brew "lazygit"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@16"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Maintained ctags implementation
brew "universal-ctags"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Android SDK component
cask "android-platform-tools"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
vscode "aaron-bond.better-comments"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "alexcvzz.vscode-sqlite"
vscode "antfu.theme-vitesse"
vscode "astro-build.astro-vscode"
vscode "atomiks.moonlight"
vscode "azemoh.one-monokai"
vscode "bradlc.vscode-tailwindcss"
vscode "brandonfowler.exe-runner"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coenraads.bracket-pair-colorizer-2"
vscode "dahong.theme-bear"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "devzstudio.emoji-snippets"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dtoplak.vscode-glsllint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "helgardrichard.helium-icon-theme"
vscode "jaredkent.laserwave"
vscode "kuscamara.electron"
vscode "leveluptutorials.theme-levelup"
vscode "liviuschera.noctis"
vscode "mlueckert.a-frame-completion"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.theme-tester"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "raillyhugo.one-hunter"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "slevesque.shader"
vscode "softwaredotcom.swdc-vscode"
vscode "sonarsource.sonarlint-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zxh404.vscode-proto3"
